#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-7fn1HSt24WjguP8A

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.main_vpc: Refreshing state... [id=vpc-0b9c704b072821c0f]
module.vpc.aws_internet_gateway.main_internet_gateway: Refreshing state... [id=igw-02b78e9ca69747030]
module.vpc.aws_subnet.public_fe: Refreshing state... [id=subnet-0b33e5a89aa059f4d]
module.vpc.aws_subnet.private_be: Refreshing state... [id=subnet-095f8c8db3cdff2a2]
module.vpc.aws_subnet.private_db: Refreshing state... [id=subnet-0e80ccc9b80f99b91]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat_be will be created
  + resource "aws_eip" "nat_be" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat_db will be created
  + resource "aws_eip" "nat_db" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_nat_gateway.nat_gw_be will be created
  + resource "aws_nat_gateway" "nat_gw_be" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-095f8c8db3cdff2a2"
    }

  # module.vpc.aws_nat_gateway.nat_gw_db will be created
  + resource "aws_nat_gateway" "nat_gw_db" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0e80ccc9b80f99b91"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*